<template>
  <div class="row">
    <nuxt-link class="col-4" v-for="(link, n) in links" :key="n" :to="link.to">
      {{ link.title }}
    </nuxt-link>
  </div>
</template>

<script>
export default {
  name: "Bulletin",
  data() {
    return {
      links: [
        { title: "وظائف أعمال الامن", to: "/" },
        { title: "وظائف أعمال النظافه", to: "/" },
        { title: "وظائف ساعي بوفيه / Office Boy", to: "/" },
        { title: "وظائف أعمال المخازن", to: "/" },
        { title: "وظائف تنسيق أرفف", to: "/" },
        { title: "وظائف مراقب كاميرات", to: "/" },
        { title: "وظائف عماله", to: "/" },
        { title: "وظائف دراي كلين", to: "/" },
        { title: "وظائف عماله منزليه", to: "/" },
        { title: "شاهد كل وظائف وخدمات", to: "/" },
        { title: "وظائف مبيعات خارجيه وتوزيع", to: "/" },
        { title: "وظائف مبيعات داخليه", to: "/" },
        { title: "وظائف تسويق الكتروني  / سوشيال ميديا", to: "/" },
        { title: "وظائف مندوب تسويق", to: "/" },
        { title: "وظائف مبيعات طبيه", to: "/" },
        { title: "وظائف خدمه عملاء", to: "/" },
        { title: "وظائف تسويق ومبيعات عقاريه", to: "/" },
        { title: "وظائف تسويق ومبيعات عبر الهاتف", to: "/" },
        { title: "وظائف كاشير", to: "/" },
        { title: "وظائف مبيعات تامين", to: "/" },
        { title: "وظائف مندوب مشتريات", to: "/" },
        { title: "وظائف دعاية", to: "/" },
        { title: "وظائف كول سنتر / call center", to: "/" },
        { title: "وظائف منسق دعايا وعروض / أشرز", to: "/" },
        { title: "وظائف قياده سيارات ركوب و نقل ثقيل", to: "/" },
        { title: "وظائف قياده الدراجات البخاريه", to: "/" },
        { title: "وظائف توصيل", to: "/" },
        { title: "وظائف قيادة الاوناش والمعدات الثقيله", to: "/" },
        { title: "وظائف اشراف حركه", to: "/" },
        { title: "وظائف تحصيل", to: "/" },
        { title: "شاهد كل وظائف قياده وتوصيل", to: "/" },
        { title: "وظائف إدارة المخازن", to: "/" },
        { title: "وظائف سكرتاريه واستقبال", to: "/" },
        { title: "وظائف إدارة فروع", to: "/" },
        { title: "وظائف موارد بشريه", to: "/" },
        { title: "وظائف إدارة أعمال", to: "/" },
        { title: "وظائف أعمال المكتب", to: "/" },
        { title: "وظائف إدخال بيانات", to: "/" },
        { title: "وظائف اعمال لوجستيه", to: "/" },
        { title: "وظائف إدارة مكاتب", to: "/" },
        { title: "وظائف ترجمه", to: "/" },
        { title: "وظائف اشراف تغذيه", to: "/" },
        { title: "وظائف شئون طلبه / موظفين", to: "/" },
        { title: "شاهد كل وظائف اعمال إداريه", to: "/" },
        { title: "وظائف تصميم جرافيك", to: "/" },
        { title: "وظائف دعم فني", to: "/" },
        { title: "وظائف حاسبات وشبكات", to: "/" },
        { title: "وظائف برمجه", to: "/" },
        { title: "وظائف صيان كمبيوتر", to: "/" },
        { title: "شاهد كل وظائف تكنلوجيا معلومات واتصالات", to: "/" },
        { title: "وظائف مساحة طرق", to: "/" },
        { title: "وظائف نقاشه ودهان الحوائط", to: "/" },
        { title: "وظائف الاشراف على أعمال التشييد والبناء", to: "/" },
        { title: "وظائف أعمال الخرسانه", to: "/" },
        { title: "وظائف أعمال ديكور وتشطيبات", to: "/" },
        { title: "شاهد كل وظائف التشييد والبناء", to: "/" },
        { title: "أعلن عن وظيفه معينه", to: "/" },
        { title: "أطلب وظيفه الان", to: "/" },
        { title: "وظائف حسابات", to: "/" },
        { title: "وظائف محاماه", to: "/" },
        { title: "وظائف امانة صندوق", to: "/" },
        { title: "وظائف إداره ماليه", to: "/" },
        { title: "وظائف مراجعه ماليه", to: "/" },
        { title: "وظائف فرز اموال", to: "/" },
        { title: "وظائف استشارات قانونيه", to: "/" },
        { title: "وظائف استشارات ماليه", to: "/" },
        { title: "وظائف مراقبة اموال", to: "/" },
        { title: "وظائف شحن وتخليص جمركي", to: "/" },
        { title: "شاهد كل وظائف ماليه وقانونيه", to: "/" },
        { title: "وظائف هندسة ميكانيكا", to: "/" },
        { title: "وظائف هندسة عماره وديكور", to: "/" },
        { title: "وظائف هندسة كهرباء واتصالات", to: "/" },
        { title: "وظائف هندسة مدنيه", to: "/" },
        { title: "وظائف هندسة زراعيه", to: "/" },
        { title: "وظائف هندسة صيانه", to: "/" },
        { title: "وظائف هندسة تخطيط ومتابعه", to: "/" },
        { title: "وظائف هندسة معدات طبيه", to: "/" },
        { title: "وظائف هندسة مساحه", to: "/" },
        { title: "وظائف هندسة نسيج", to: "/" },
        { title: "وظائف هندسة مشروعات", to: "/" },
        { title: "شاهد كل وظائف عماره وهندسه", to: "/" },
        { title: "وظائف كهرباء", to: "/" },
        { title: "وظائف التبريد والتكييف", to: "/" },
        { title: "وظائف لحام", to: "/" },
        { title: "وظائف نجاره", to: "/" },
        { title: "وظائف سباكه", to: "/" },
        { title: "وظائف فنين صيانه هواتف محموله", to: "/" },
        { title: "وظائف اعمال الحداده", to: "/" },
        { title: "وظائف حداده وخراطه", to: "/" },
        { title: "وظائف تركيب تصنيع الوميتال", to: "/" },
        { title: "وظائف اعمال البلاط والرخام", to: "/" },
        { title: "وظائف أعمال يدويه", to: "/" },
        { title: "وظائف منجد", to: "/" },
        { title: "وظائف صيانه عامه / صيانه مباني", to: "/" },
        { title: "وظائف سروجي  سيارات", to: "/" },
        { title: "وظائف اعمال زجاج", to: "/" },
        { title: "وظائف منجد واسترجي", to: "/" },
        { title: "وظائف خدمات واكسسوارات سيارات", to: "/" },
        { title: "وظائف صيانه وتركيب مصاعد", to: "/" },
        { title: "وظائف تركيب الارضيات", to: "/" },
        { title: "شاهظ كل وظائف حرف", to: "/" },
        { title: "وظائف فنين وعمال انتاج", to: "/" },
        { title: "وظائف صيانه الماكينات", to: "/" },
        { title: "وظائف جوده", to: "/" },
        { title: "وظائف ميكانيكا السيارات", to: "/" },
        { title: "وظائف كهرباء السيارات", to: "/" },
        { title: "وظائف النسيج والملابس الجاهزه", to: "/" },
        { title: "وظائف سلامه وصحه مهنه وامن صناعي", to: "/" },
        { title: "وظائف صيانه اجهزه كهرباء", to: "/" },
        { title: "وظائف انتاحج زراعي وحيواني", to: "/" },
        {
          title: "وظائف فنين صيانه وتركيب دوائر الكترونيه / أجهزه الامان",
          to: "/"
        },
        { title: "وظائف تعبئه وتغليف المنتجات", to: "/" },
        { title: "وظائف اعمال طباعه", to: "/" },
        { title: "وظائف فنين تشغيل CNC", to: "/" },
        { title: "وظائف تجميع المنتجات", to: "/" },
        { title: "وظائف طلاء المنتجات", to: "/" }
      ]
    };
  }
};
</script>

<style lang="scss" scoped>
a {
  overflow: hidden;
  text-overflow: ellipsis;
  color: #5b28bb;
}
</style>
