const state = () => {
    return {
      en: {
        header: {
          form: [
            "twitter",
            "facebook",
            "youtube",
            "instagram",
            "facebook-wifi"
          ],
          nav: []
        }
      },
      ar: {
        header: {
          form: ["تويتر", "فيسبوك", "يوتيوب", "انستجرام", "واي فاي فيسبوك"],
          nav: [
            { title: "الرئيسيه", to: "/" },
            {
              title: "قطاع الخدمات الصناعيه",
              to: "/",
              sub: [
                {
                  title: "توريد عماله فنيه مدربه",
                  to: "/",
                  sub: [
                    { title: "توريد عمال انتاج", to: "/" },
                    { title: "توريد عمال تحميل وتعتيق", to: "/" },
                    { title: "توريد عمال نظافه", to: "/" },
                    { title: "توريد أفراد أمن", to: "/" },
                    { title: "توريد عماله موسميه", to: "/" }
                  ]
                },
                { title: "تسويق منتجات صناعيه", to: "/" },
                { title: "استشارات إدارية وفنيه", to: "/" },
                { title: "دراسة جدوى اقتصاديه", to: "/" },
                { title: "تمويل مشروعات", to: "/" },
                { title: "شراكة مشروعات", to: "/" },
                { title: "رعايه طبيه", to: "/" },
                { title: "الإنشاءات الهندسيه", to: "/" },
                { title: "الإستيراد والتصدير", to: "/" },
                { title: "فدم على مشروعك", to: "/" }
              ]
            },
            {
              title: "قطاع خدمات المزارع",
              to: "/",
              sub: [
                { title: "خدمات مزارع الدواجن", to: "/" },
                { title: "منتجات مزارع الدواجن", to: "/" },
                { title: "خدمات مزارع الفاكهه", to: "/" },
                { title: "منتجات مزارع الفاكهه", to: "/" },
                { title: "أضف مزرعتك", to: "/" },
                { title: "أضف منتجك", to: "/" },
                { title: "إطلب خدمتك", to: "/" }
              ]
            },
            {
              title: "قطاع الاستثمار",
              to: "/",
              sub: [
                { title: "فرص الإستثمار الصناعي", to: "/" },
                { title: "دراسة الجدوى الإقتصاديه", to: "/" },
                { title: "التمويل والشراكة", to: "/" },
                { title: "المخازن والأراضي الصناعيه", to: "/" },
                { title: "الاستيراد والتصدير", to: "/" },
                { title: "توريد خطوط انتاج", to: "/" },
                { title: "توريد الخامات", to: "/" },
                { title: "توريد مستلزمات الإنتاج", to: "/" },
                { title: "الهيكل الإداري والموارد البشريه", to: "/" },
                { title: "الهيكل الانتاج والتشغيل", to: "/" },
                { title: "الأنظمه الماليه", to: "/" },
                { title: "البحوث التسويقيه وأنظمه البيع", to: "/" }
              ]
            },
            {
              title: "قطاع الصناعات المتخصصه",
              to: "/",
              sub: [
                {
                  title: "مصانع OMC لليونيفورم",
                  to: "/",
                  sub: [
                    { title: "يونيفورم مصانع", to: "/" },
                    { title: "يونيفورم شركات", to: "/" },
                    { title: "يونيفورم فنادق", to: "/" },
                    { title: "يونيفورم مدراس", to: "/" },
                    { title: "يونيفورم مستشفيات", to: "/" },
                    { title: "يونيفورم فرى سياحيه", to: "/" },
                    { title: "يونيفورم حضانات", to: "/" },
                    { title: "يونيفورم أنديه رياضيه", to: "/" },
                    { title: "يونيفورم جامعات", to: "/" },
                    { title: "ملابس جاهزه", to: "/" }
                  ]
                },
                {
                  title: "مصانع OMC للمستلزمات الطبيه",
                  to: "/",
                  sub: [
                    { title: "كمامات طبيه", to: "/" },
                    { title: "جاون طبي", to: "/" },
                    { title: "جاونتي", to: "/" },
                    { title: "اوفر هيد واوفر شوز", to: "/" },
                    { title: "بدلة عزل", to: "/" }
                  ]
                },
                {
                  title: "مصانع OMC للصناعات الغذائيه المتكامله",
                  to: "/",
                  sub: [
                    { title: "بقوليات", to: "/" },
                    { title: "بودر", to: "/" },
                    { title: "مجففات", to: "/" },
                    { title: "خضروات وفاكهه", to: "/" },
                    { title: "عسل", to: "/" },
                    { title: "عصائر وسوائل", to: "/" },
                    { title: "جبنه وطحينه", to: "/" },
                    { title: "زيوت وسمنه", to: "/" },
                    { title: "لب وتسالي", to: "/" },
                    { title: "توابل وبهارات", to: "/" }
                  ]
                },
                {
                  title: "مصانع OMC للصناعات البلاستيكيه",
                  to: "/",
                  sub: [
                    { title: "أكياس بلاستيكيه", to: "/" },
                    { title: "لعب اطفال", to: "/" },
                    { title: "حقن بلاستيك", to: "/" },
                    { title: "أواني بلاستيك", to: "/" },
                    { title: "أكواب بلاستيك", to: "/" }
                  ]
                },
                {
                  title: "مصانع OMC للصناعات الورقيه",
                  to: "/",
                  sub: [
                    { title: "مطبعة عمال مصر", to: "/" },
                    { title: "ورق طباعه", to: "/" },
                    { title: "مناديل ورقيه", to: "/" },
                    { title: "كوبايات ورقيه", to: "/" },
                    { title: "شنط ورقيه", to: "/" }
                  ]
                }
              ]
            },
            {
              title: "قطاع الانشاءات الصناعيه",
              to: "/",

              sub: [
                { title: "تصميمات هندسيه", to: "/" },
                { title: "إنشاءات صناعيه", to: "/" },
                { title: "تشطيبات", to: "/" },
                { title: "ترميمات", to: "/" },
                { title: "مواد بناء", to: "/" },
                { title: "مواد تشطيبات", to: "/" }
              ]
            },
            {
              title: "سوق المنتجات الصناعيه",
              to: "/",
              sub: [
                { title: "منتجات ماكينات ومعدات", to: "/" },
                { title: "منتجات قطع غيار", to: "/" },
                { title: "منتجات الامن الصناعي", to: "/" },
                { title: "منتجات الميكنه الزراعيه", to: "/" },
                { title: "منتجات الدهانات والأصباغ", to: "/" },
                { title: "منتجات الزجاج", to: "/" },
                { title: "منتجات الإنشاءات ومواد البناء", to: "/" },
                { title: "منتجات المواد العازله", to: "/" },
                { title: "منتجات المواد الكيميائيه", to: "/" },
                { title: "منتجات تشغيل المعادن", to: "/" },
                { title: "منتجات الثروه الداجنيه", to: "/" },
                { title: "تصفيات منتجات مصانع", to: "/" },
                { title: "منتجات عذائيه", to: "/" },
                { title: "منتجات ورقيه", to: "/" },
                { title: "منتجات أجهزه منزليه", to: "/" },
                { title: "منتجات أجهزه إلكترونيه", to: "/" },
                { title: "منتجات بلاستيكيه", to: "/" },
                { title: "منتجات دوائيه", to: "/" },
                { title: "منتجات مستلزمات طبيه", to: "/" },
                { title: "منتجات ملابس جاهزه", to: "/" },
                { title: "منتجات منظفات", to: "/" },
                { title: "منتجات عنايه شخصيه", to: "/" },
                { title: "منتجات أحذيه جلديه", to: "/" },
                { title: "منتجات رخام وجرانيت", to: "/" },
                { title: "عرض منتج", to: "/" },
                { title: "شراء منتج", to: "/" },
                { title: "الاستفسار عن منتج", to: "/" }
              ]
            },
            {
              title: "سوق العقارات الصناعيه",
              to: "/",
              sub: [
                { title: "شراء مصانع", to: "/" },
                { title: "إيجار مصانع", to: "/" },
                { title: "مخازن صناعيه", to: "/" },
                { title: "أرض فضاء", to: "/" },
                { title: "تشطيبات مصانع", to: "/" },
                { title: "عرض عقار صناعي للبيع", to: "/" },
                { title: "عرض عقار صناعي للايجار", to: "/" }
              ]
            },
            {
              title: "سوق الخدمات الصناعيه",
              to: "/",
              sub: [
                { title: "شركات نظافه", to: "/" },
                { title: "شركات آمن", to: "/" },
                { title: "شركات إستيراد وتصدير", to: "/" },
                { title: "شركات أدوات مكتبيه", to: "/" },
                { title: "شركات أثاث مكتبي", to: "/" },
                { title: "شركات أمن صناعي", to: "/" },
                { title: "شركات سياحه", to: "/" },
                { title: "شركات برمجيات", to: "/" },
                { title: "شركات سلامه وصحه مهنيه", to: "/" },
                { title: "مكاتب مراجعات ماليه", to: "/" },
                { title: "شركات دعايا وإعلان", to: "/" },
                { title: "شركات تسويق", to: "/" },
                { title: "شركات كاترينج", to: "/" },
                { title: "شركات شهادة الايزو", to: "/" },
                { title: "شركات طباعه", to: "/" },
                { title: "شركات موبايل", to: "/" },
                { title: "شركات استشارات وتدريب", to: "/" },
                { title: "شركات شحن", to: "/" }
              ]
            },
            {
              title: "مبادرات عمال مصر",
              to: "/",
              sub: [
                { title: "بطل كسل وانزل اشتغل", to: "/" },
                { title: "قريه بدون بطاله", to: "/" },
                { title: "اصنع وشغل غيرك", to: "/" },
                { title: "العامل المثالي", to: "/" },
                { title: "الغالي يرخصلك", to: "/" },
                { title: "صناعتنا سندنا في أزمتنا", to: "/" }
              ]
            },
            {
              title: "مدرسه عمال مصر",
              to: "/",
              sub: [
                {
                  title: "مدرسة عمال مصر الصناعيه",
                  to: "/",
                  sub: [
                    { title: "الصف الاول", to: "/" },
                    { title: "الصف الثاني", to: "/" },
                    { title: "الصف الثالث", to: "/" }
                  ]
                },
                { title: "مركز التدريب المهني", to: "/" },
                {
                  title: "برامج تدريبيه",
                  to: "/",
                  sub: [
                    { title: "تدريب العمال", to: "/" },
                    { title: "تأهيل نفسي", to: "/" },
                    { title: "فنون الاداره", to: "/" },
                    { title: "المحاسبه الماليه", to: "/" },
                    { title: "التسويق الرقمي", to: "/" },
                    { title: "التجاره الالكتونيه", to: "/" },
                    { title: "الموارد البشريه", to: "/" },
                    { title: "التخطيط والتطوير", to: "/" },
                    { title: "الجوده الشامله", to: "/" },
                    { title: "الإنتاجيه والتشغيل", to: "/" }
                  ]
                }
              ]
            },
            {
              title: "نادي عمال مصر",
              to: "/",
              sub: [
                { title: "كرة القدم", to: "/" },
                { title: "كرة السله", to: "/" },
                { title: "الكره الطائره", to: "/" },
                { title: "كرة التنس", to: "/" },
                { title: "بلياردو", to: "/" },
                { title: "كارتيه", to: "/" }
              ]
            },
            {
              title: "مستشفى عمال مصر",
              to: "/",
              sub: [
                { title: "عيادة الباطنه", to: "/" },
                { title: "عيادة الرمد", to: "/" },
                { title: "عيادة الأسنان", to: "/" },
                { title: "عيادة الجراحه", to: "/" },
                { title: "عيادة الأنف والأذن", to: "/" },
                { title: "عيادة النساء والتوليد", to: "/" },
                { title: "عيادة المخ والاعصاب", to: "/" },
                { title: "عيادة الأمراض الصدريه", to: "/" },
                { title: "عيادة الجلديه والتناسليه", to: "/" },
                { title: "عيادة الأطفال وحديثي الولاده", to: "/" },
                { title: "عيادة القلب والاوعيه الدمويه", to: "/" },
                { title: "الاستقبال والطوارئ", to: "/" },
                { title: "إضفط لطلب دكتور", to: "/" },
                { title: "إضفط لطلب أدويه", to: "/" },
                { title: "إضفط لطلب سيارة إسعاف", to: "/" }
              ]
            },
            {
              title: "جريدة عمال مصر",
              to: "/",
              sub: [
                { title: "أخبار عمال مصر", to: "/" },
                { title: "أخبار الشركات", to: "/" },
                { title: "الأسواق", to: "/" },
                { title: "البورصه والبنوك", to: "/" },
                { title: "آخبار الصناعه العالميه", to: "/" },
                { title: "التقارير والتحقيقات", to: "/" },
                { title: "ملفات", to: "/" },
                { title: "الاقتصاد العالمي", to: "/" },
                { title: "حوارات صحفيه", to: "/" },
                { title: "أخبار الإستثمار", to: "/" },
                { title: "عالم التكنلوجيا", to: "/" },
                { title: "الذكاء الاصطناعي", to: "/" },
                { title: "مقالات", to: "/" },
                { title: "صور الاسبوع", to: "/" },
                { title: "شخصيات هامه", to: "/" },
                { title: "الصحف العربيه", to: "/" },
                { title: "أخبار متنوعه", to: "/" },
                { title: "العدد الورقي", to: "/" },
                { title: "للإعلان في الجريده", to: "/" },
                { title: "لإرسال مقال", to: "/" },
                { title: "لطلب مصدر", to: "/" }
              ]
            },
            {
              title: "قناة عمال مصر",
              to: "/",
              sub: [
                { title: "قناة عمال مصر الفضائيه", to: "/" },
                { title: "راديو OMC", to: "/" },
                { title: "قناة عمال مصر يوتيوب", to: "/" }
              ]
            },
            {
              title: "خدمات موظفين عمال مصر",
              to: "/",
              sub: [
                { title: "تقديم طلب أجازه", to: "/" },
                { title: "تقديم طلب سلفه ماليه", to: "/" },
                { title: "تقديم طلب زيادة مرتب", to: "/" },
                { title: "تقديم طلب نقل", to: "/" },
                { title: "تقديم طلب إخلاء طرف", to: "/" },
                { title: "تقديم طلب إستقاله", to: "/" },
                { title: "تقديم طلب مذكره", to: "/" },
                { title: "تقديم طلب شكوى", to: "/" },
                { title: "تقديم طلب تحقيق", to: "/" },
                { title: "تقديم طلب منحه", to: "/" },
                { title: "تقديم طلب إعتذار", to: "/" },
                { title: "تقديم طلب خدمه عامه", to: "/" }
              ]
            },
            { title: "مدينة عمال مصر الذكيه", to: "/OmcCity" },
            {
              title: "مكتبه العلوم والابجاث الصناعيه",
              to: "/",
              sub: [
                { title: "قسم تاريخ الصناعه المصريه", to: "/" },
                { title: "قسم العلوم الإداريه والفنيه", to: "/" },
                { title: "قسم علوم الموارد البشريه", to: "/" },
                { title: "قسم التنميه البشريه", to: "/" },
                { title: "قسم التشغيل والانتاج", to: "/" },
                { title: "قسم التسويق الرقمي", to: "/" },
                { title: "قسم المهارات الحياتيه", to: "/" },
                { title: "قسم الثقافه العامه", to: "/" },
                { title: "قسم البحوث الصناعيه", to: "/" },
                { title: "كلب بحث او كتاب", to: "/" },
                { title: "تقديم بحث", to: "/" }
              ]
            },
            {
              title: "بنك المشروعات والافكار",
              to: "/",
              sub: [
                { title: "أفكار مشروعات جاهزه", to: "/" },
                { title: "دراسات جدوى جاهزه", to: "/" },
                { title: "تسجيل فكرة مشروع", to: "/" },
                { title: "طلب فكرة مشروع", to: "/" },
                { title: "تنفيذ فكرة مشروع", to: "/" }
              ]
            },
            {
              title: "بنك الخدمات الحكوميه",
              to: "/",
              sub: [
                { title: "استخراج شهادات المزاوله", to: "/" },
                { title: "استخراج التراخيص", to: "/" },
                { title: "تأمينات اجتماعيه", to: "/" },
                { title: "تأمينات طبيه", to: "/" },
                { title: "سجلات تجاريه", to: "/" },
                { title: "سجلات صناعيه", to: "/" },
                { title: "تخليصات جمركيه", to: "/" },
                { title: "تحويل عملات", to: "/" },
                { title: "تأشيرات سفر", to: "/" }
              ]
            },
            {
              title: "بنك الخدمات المدنيه",
              to: "/",
              sub: [
                { title: "طلب تقديم وظيفه", to: "/" },
                { title: "طلب تقديم تمويل مشروع", to: "/" },
                { title: "طلب تقديم شراكة مشروع", to: "/" },
                { title: "طلب تقديم مقترح", to: "/" },
                { title: "طلب تقديم شكوى", to: "/" },
                { title: "طلب تقديم زياره", to: "/" },
                { title: "طلب تقديم خدمه", to: "/" },
                { title: "طلب تقديم معلومه", to: "/" },
                { title: "طلب تقديم آخر", to: "/" }
              ]
            },
            {
              title: "بنك التواصل السريع",
              to: "/",
              sub: [
                { title: "فيسبوك", to: "/" },
                { title: "إيميل", to: "/" },
                { title: "واتساب بيزنس", to: "/" },
                { title: "تويتر", to: "/" },
                { title: "لينكد ان", to: "/" },
                { title: "اوليكس", to: "/" },
                { title: "تليجرام", to: "/" },
                { title: "جوجل map", to: "/" },
                { title: "جوجل بلس", to: "/" },
                { title: "انستجرام", to: "/" },
                { title: "يوتيوب", to: "/" },
                { title: "سناب شات", to: "/" },
                { title: "بينتريست", to: "/" },
                { title: "تمبلر", to: "/" },
                { title: "ماي اسبيس", to: "/" },
                { title: "بريسكوب", to: "/" },
                { title: "بريسكوب", to: "/" },
                { title: "ارقام الهاتف المحمول", to: "/" },
                { title: "ارقام الخط الارضي", to: "/" },
                { title: "الخط الساخن", to: "/" },
                { title: "اوركوت", to: "/" },
                { title: "ديغ", to: "/" },
                { title: "زووم روم", to: "/" },
                { title: "شات روم", to: "/" },
                { title: "الاتصال بالتسويق", to: "/" },
                { title: "الاتصال بالمبيعات", to: "/" },
                { title: "الاتصال بالموارد البشريه", to: "/" },
                { title: "الاتصال بالتشغيل", to: "/" },
                { title: "الاتصال بالسكن", to: "/" },
                { title: "الاتصال بالنقل", to: "/" },
                { title: "الاتصال بالمشتريات", to: "/" },
                { title: "الاتصال بالحسابات", to: "/" },
                { title: "التواصل مع الادراه العليا", to: "/" },
                { title: "الاتصال بالشئون القانونيه", to: "/" },
                { title: "الاتصال بالادراه الهندسيه", to: "/" },
                { title: "الاتصال بالمكتب الإعلامي", to: "/" }
              ]
            },
            { title: "نشرة وظائف عمال مصر", to: "/" },
            { title: "مؤتمرات وندوات", to: "/" },
            { title: "شهادات تكريم", to: "/" },
            {
              title: "خدمات فوري عمال مصر",
              to: "/",
              sub: [
                { title: "دفع فواتير الغاز والكهرباء والمياه", to: "/" },
                {
                  title:
                    "شحن رصيد جميع شركات الاتصال(فودافون - اورانج - وي - اتصالات)",
                  to: "/"
                },
                { title: "شحن كروت الكهرباء", to: "/" },
                { title: "دفع فواتير الانترنت المنزلي", to: "/" },
                {
                  title:
                    "دفع مصاريف المدارس والجامعات لابناء العاملين بالمجموعه",
                  to: "/"
                },
                { title: "دفع اقساط البنوك والشركات", to: "/" },
                { title: "دفع الخدمات الطبيه والعلاجيه", to: "/" },
                { title: "دفع التأمينات ووثائق التأمين", to: "/" },
                { title: "دفع مخالفات المرور", to: "/" },
                { title: "حجز تذاكر السينما والمواصلات", to: "/" },
                { title: "دفع اشتراكات النقابات", to: "/" },
                { title: "دفع اشتراك الانديه", to: "/" },
                { title: "دفع التبرعات", to: "/" }
              ]
            },
            { title: "المدن الصناعيه", to: "/" },
            { title: "القطاعات الصناعيه", to: "/" },
            { title: "أعلن معنا", to: "/" },
            { title: "أضف مصنعك", to: "/" },
            { title: "موبايل ابلكيشن عمال مصر", to: "/" }
          ]
        }
      }
    };
  },
  getters = {
    ar: state => state.ar,
    en: state => state.en
  };

export default {
  state,
  getters
};
