<template>
  <div class="row">
    <nuxt-link class="col-4" v-for="(link, n) in links" :to="link.to" :key="n">
      {{ link.title }}
    </nuxt-link>
  </div>
</template>

<script>
export default {
  name: "CitiesGuide",
  data() {
    return {
      links: [
        { title: "مدينه سوهاج", to: "/" },
        { title: "مدينه نجع حمادي", to: "/" },
        { title: "مدينه قنا", to: "/" },
        { title: "مدينه الاقصر", to: "/" },
        { title: "مدينه اسوان", to: "/" },
        { title: "مدينه مطروح والساحل", to: "/" },
        { title: "مدينه الوادي الجديد", to: "/" },
        { title: "منطقه مدينه نصر الصناعيه", to: "/" },
        { title: "المناطق الحره", to: "/" },
        { title: "منطقة شق الثعبان", to: "/" },
        { title: "منطقة التبين", to: "/" },
        { title: "منطقة البساتين", to: "/" },
        { title: "منطقة حسر السويس", to: "/" },
        { title: "منطقة الحرفيين", to: "/" },
        { title: "منطقة العباسيه الصناعيه", to: "/" },
        { title: "منطقة  التجمع الصناعيه", to: "/" },
        { title: "مدينة جمصه", to: "/" },
        { title: "مدينة وادي النطرون", to: "/" },
        { title: "مدن ومناطق آخرى", to: "/" },
        { title: "مدينة النوباريه", to: "/" },
        { title: "مدينة حلوان", to: "/" },
        { title: "مدينة القناطر", to: "/" },
        { title: "مدينة طنطا", to: "/" },
        { title: "مدينة الدقهليه", to: "/" },
        { title: "مدينة البحيره", to: "/" },
        { title: "مدينة الغربيه", to: "/" },
        { title: "مدينة الفيوم", to: "/" },
        { title: "مدينة 15 مايو", to: "/" },
        { title: "مدينة شمال سيناء", to: "/" },
        { title: "مدينة جنوب سيناء", to: "/" },
        { title: "مدينة  البحر الاحمر", to: "/" },
        { title: "مدينة السلام", to: "/" },
        { title: "مدينة بورسعيد", to: "/" },
        { title: "مدينة الاسماعيليه", to: "/" },
        { title: "مدينة السويس", to: "/" },
        { title: "مدينة القنطره", to: "/" },
        { title: "مدينة بني سويف", to: "/" },
        { title: "مدينة المنيا", to: "/" },
        { title: "مدينة اسيوط", to: "/" },
        { title: "مدينة العاشر من رمضان", to: "/" },
        { title: "السادس من اكتوبر", to: "/" },
        { title: "مدينة السادات", to: "/" },
        { title: "مدينة برج العرب", to: "/" },
        { title: "مدينة بدر", to: "/" },
        { title: "مدينة العبور", to: "/" },
        { title: "مدينة ابو رواش", to: "/" },
        { title: "مدينة شبرا الخيمه", to: "/" },
        { title: "مدينة القاهره", to: "/" },
        { title: "مدينة الجيزه", to: "/" },
        { title: "مدينة الاسكندريه", to: "/" },
        { title: "مدينة العامريه", to: "/" },
        { title: "مدينة القليوبيه", to: "/" },
        { title: "مدينة دمياط", to: "/" },
        { title: "مدينة قويسنا", to: "/" },
        { title: "مدينة المنصوره", to: "/" },
        { title: "مدينة المنوفيه", to: "/" },
        { title: "مدينة كفرالشيخ", to: "/" },
        { title: "مدينة المحله الكبرى ", to: "/" },
        { title: "مدينة الصالحيه الجديده", to: "/" },
        { title: "مدينة الشرقيه", to: "/" }
      ]
    };
  }
};
</script>

<style lang="scss" scoped>
a {
  overflow: hidden;
  text-overflow: ellipsis;
  color: #5b28bb;
}
</style>
