<template>
  <main class="row main">
    <div class="col-9">
      <article class="row">
        <h4 class="col-2 red">من نحن...؟</h4>
        <div class="col">
          <p>
            تأسست مجموعة عمال مصر في عام 2010م في مدينة السادس من أكتوبــر ،
            حــيـــث كانت أول كيان خدمي وصناعي في وزارة التجارة والصناعة تم
            ترخيص له قــــطـــــاع إدارة وتشغيل خطوط الإنتاج بالمصانع وتوالت
            الأحلام والقطاعات لتصبح عمال مصـــر تحقق استراتيجيه توحيد باب الخدمة
            للمستثمر الصناعي من خلال القطاعات التالية:
          </p>
          <ol>
            <li>
              قطاع إدارة وتشغيل خطوط الإنتاج (توفير عماله فنيه مُدربه للمصانع).
            </li>
            <li>قطاع تسويق المنتجات الصناعية.</li>
            <li>
              قطاع دراسة جدوى المشروعات والاستشارات الفنية والإدارية للمصانع .
            </li>
            <li>قطاع جريدة عمال مصر الصناعية المتخصصة.</li>
            <li>
              قطاع مصنع <span class="red">omc</span> لتصنيع اليونيفورم والملابس
              الجاهزة.
            </li>
            <li>
              قطاع مصنع <span class="red">omc</span> لصناعة المستلزمات الطبية.
            </li>
            <li>
              قطاع مصنع <span class="red">omc</span> لتعبئة المواد الغذائية.
            </li>
            <li>قطاع الإنشاءات الصناعية.</li>
            <li>مدرسة عمال مصر الثانوية الصناعية.</li>
          </ol>
        </div>
      </article>
      <article class="row">
        <h4 class="red col-2">هدفنا</h4>
        <div class="col">
          <ol>
            <li>توحيد باب الخدمه للمستثمر الصناعي.</li>
            <li>
              أن تكون مجموعه عمال مصر البوابه الاساسيه للمستثمرين والشباب
              المتقدمين للعمل
            </li>
            <li>توسيع فروع عمال مصر في كافة المناطق الصناعية.</li>
            <li>
              تأهيل الكوادر البشرية المصريهة للعمل في الصناعات المختلفة بالدول
              المتقدمه.
            </li>
            <li>بناء ثقة مع عملائنا في جميع المشروعات التي نعمل فيها.</li>
          </ol>
        </div>
      </article>
      <article class="row">
        <h4 class="red col-2">رؤيتنا</h4>
        <div class="col">
          إن المجال الصناعي من أهم المجالات التي يجب الإهتمام بها وبخدماتها ومن
          أهم الخدمـــــــات التي يحتاجها المستثمر الصناعي أو مدير الموارد
          البشرية في أي منشأة صناعيةهو الكــــادر البشري المُدرب والمؤهل لبيئة
          العمل وهذا ما نسعى إليه في البحث والتنقيب عن هذا الكادر ومن ثم تدريبه
          وتأهيله وعمل بيئة مناسبة له في معيشته وفي عمله ، ومساعدة
          عمـــــــلائنا بدعمهم بهذه العماله المُدربة والمؤهله للعمل.
        </div>
      </article>
    </div>
    <div class="col-3 end">
      <img src="/home/1.png" />
    </div>
  </main>
</template>

<script>
export default {
  name: "LeftSide"
};
</script>

<style lang="scss" scoped>
.main {
  .red {
    background: transparent !important;
    color: $red !important;
  }

  h4 {
    font-size: 2em;
  }

  ol {
    padding: 0 1.2em;
    list-style: decimal-leading-zero;
  }

  .end {
    display: flex;
    align-items: flex-end;

    img {
      object-fit: contain;
      width: 100%;
      height: auto;
    }
  }
}
</style>
